In [2]:
%run "../LOS.ipynb"

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
df = dreams_mastersheet

In [4]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [5]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

18850

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14           931     813     715           5095         7554
15-19          1007     710     432           5288         7437
20-24           520     340     191           2808         3859
Grand Total    2458    1863    1338          13191        18850

In [6]:
base18plus = df[
    (df.newage_range!="not_valid_age")
    &(df.newage_range!="25-29")
    &(df.newage_range!="10-17")
    &(df.timeOn_system=="required_Time_on")
]
base18plus.code.count()
base18plus_table = base18plus.pivot_table(index="newage_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base18plus_table

6339

fiscal_year   FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
newage_range
18-19            340     242     130           1768         2480
20-24            520     340     191           2808         3859
Grand Total      860     582     321           4576         6339

# curriculum

In [7]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

15849

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14           744     627     590           4362         6323
15-19           813     534     374           4525         6246
20-24           410     271     143           2456         3280
Grand Total    1967    1432    1107          11343        15849

In [8]:
curriculum_inc = base[
    (base.dreams_curriculum=="curriculum_inc")
]
curriculum_inc.code.count()

curriculum_inc_table = curriculum_inc.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_inc_table

3001

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14           187     186     125            733         1231
15-19           194     176      58            763         1191
20-24           110      69      48            352          579
Grand Total     491     431     231           1848         3001

# Condoms

In [9]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3164

3377

In [10]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     101      43            221          447
15-19           307     171     132            972         1582
20-24           237      92      57            749         1135
Grand Total     626     364     232           1942         3164

In [11]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     106      84            237          509
15-19           321     203     154           1007         1685
20-24           248     115      62            758         1183
Grand Total     651     424     300           2002         3377

# depistage VIH

In [12]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

1958

In [13]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14            33      10      21            385          449
15-19            90      25      26            649          790
20-24           154      25      31            509          719
Grand Total     277      60      78           1543         1958

# Post Care Treatment

In [14]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

85

In [15]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0             16           19
15-19             3       1             35           39
20-24             0       0             27           27
Grand Total       6       1             78           85

# socio economique Approche

In [16]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

combin_socio_eco.code.count()

498

In [17]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  FY21Q1  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0            142          142
15-19             1       1            165          167
20-24             1       0            188          189
Grand Total       2       1            495          498

# PREP

In [18]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

503

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       1       6             14           22
15-19            47      17      38             76          178
20-24           116      17      33            137          303
Grand Total     164      35      77            227          503

In [19]:
prep_accept = base[
    (base.acc_prep=="accept")
]
prep_accept.code.count()
prep_accept_table = prep_accept.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_accept_table

46

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0              4            4
15-19             7       0       0             12           19
20-24             8       3       1             11           23
Grand Total      15       3       1             27           46

In [20]:
prep_ref = base[
    (base.ref_prep=="tested_on_given_date")
]
prep_ref.code.count()
prep_ref_table = prep_ref.pivot_table(
                        index="age_range",
                        columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_ref_table

45

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0              4            4
15-19             6       0       0             12           18
20-24             8       3       1             11           23
Grand Total      14       3       1             27           45

In [21]:

prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

41

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0              4            4
15-19             6       0       0             10           16
20-24             8       3       1              9           21
Grand Total      14       3       1             23           41

In [22]:

prep_accept[prep_accept.code.isin(prep_ref.code)].code.count()
prep_accept[~prep_accept.code.isin(prep_ref.code)].code.count()

accepter_non_referer = prep_accept[~prep_accept.code.isin(prep_ref.code)]

41

5

In [23]:
prep_ref[prep_ref.code.isin(prep_accept.code)].code.count()
prep_ref[~prep_ref.code.isin(prep_accept.code)].code.count()


ref_non_accept = prep_ref[~prep_ref.code.isin(prep_accept.code)]

41

4

In [24]:
prep_ref[prep_ref.code.isin(prep.code)].code.count()
prep_ref[~prep_ref.code.isin(prep.code)].code.count()

41

4

In [25]:
prep[prep.code.isin(prep_ref.code)].code.count()
prep[~prep.code.isin(prep_ref.code)].code.count()

41

0

In [26]:

search_missing_prep = pd.ExcelWriter(f"find_missing_prep.xlsx",engine="xlsxwriter")

accepter_non_referer.to_excel(search_missing_prep,sheet_name="accepter_non_referer",index=True,na_rep="NULL")
ref_non_accept.to_excel(search_missing_prep,sheet_name="ref_non_accept",index=True,na_rep="NULL")
search_missing_prep.save()

# jardinage

In [27]:


garden = base[
    (base.is_gardening=="yes")
]
garden.code.count()

garden_table = garden.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
garden_table

446

fiscal_year  FY21Q1  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0            137          137
15-19             1       1            151          153
20-24             1       0            155          156
Grand Total       2       1            443          446

# MUSO

In [28]:
muso = base[
    (base.is_muso=="yes")
]
muso.code.count()

muso_table = muso.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
muso_table

65

fiscal_year  Q3fy20-Q4fy20  Grand Total
age_range
10-14                    5            5
15-19                   16           16
20-24                   44           44
Grand Total             65           65

# Primary Services

In [29]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6323

1520

1072

In [30]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14           744     627     590           4362         6323
Grand Total     744     627     590           4362         6323

In [31]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
15-19           296     163     146            915         1520
Grand Total     296     163     146            915         1520

In [32]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
20-24           222      96      48            706         1072
Grand Total     222      96      48            706         1072

# reporting

In [33]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()